{

  "firstWebsite" : "https://www.firstinspires.org/",
  "firstDescription": "FIRST Robotics is an organization that runs a series of unique robotics competitions open to kids ranging from elementary school to high school. These competitions include the First Robotics Competition (FRC), the First Tech Challenge (FTC), and the First Lego League (FLL). FIRST was founded in 1989, and has evolved over the years to impact millions of people globally.",

  "FRC": {

    "gameVideo": "0zpflsYc4PA",
    "generalDescription": "FRC is the game that we participate in. Similar to the other two competitions, there is a new game concept each year, and they are wildly unique. The game gets released in early January, and we have about 6-8 weeks to build a fully-functioning robot before our first competition. The robots in FRC are generally big, heavy, and fast. There are 6 robots on the field at a time, 3 on each team. Robots are made from many different materials, like aluminum and polycarbonate, and parts are often custom-machined, 3D printed, or bought from a vendor.",
    "logo": "/images/firstRobotics/frcLogo.jpg",
    "website": "https://www.firstinspires.org/robotics/frc"

  },
  "FTC":{

    "gameVideo": "HsitvZ0JaDc",
    "generalDescription": "In FTC, the field is much smaller, and consequently robots are much smaller. There are 2 robots on each team, and there is a new game each year. FTC robots are constructed in a similar way to FRC robots, just with different components on a smaller scale.",
    "logo": "/images/firstRobotics/ftcLogo.jpg",
    "website": "https://www.firstinspires.org/robotics/ftc"


  },
  "FLL": {

    "gameVideo": "okR1AMFNV3Q",
    "generalDescription": "FLL robots are designed to complete specific challenges throughout the game field, but unlike FRC and FTC, there is only one robot on the field at a time. Robots are constructed from legos, and are generally smaller than FTC bots.",
    "logo": "/images/firstRobotics/fllLogo.png",
    "website": "https://www.firstinspires.org/robotics/fll"


  }

}