{
  "tabs": [
    {
      "year": "2022",
      "RobotImagePath": "/images/history/2022/JazzyJudi.JPG",
      "CadModelPath": "/images/history/2022/2022CAD.obj",
      "CadMaterialPath": "/images/history/2022/2022CAD.mtl",
      "GameDescription": "2022's game, Rapid React, consists mainly of scoring balls into a central hub. There are 2 levels, with the top level being worth 2 points, and the bottom 1. Towards the end of the game, robots climb rungs as high as possible, with the top rung being worth 15 points.",
      "GameName": "2022 Rapid React",
      "RevealVideo": "3rqnEFxyrlM",
      "GameReveal": "LgniEjI9cCM",
      "RecapVideo": "l-FUae_8Po4",
      "GithubCode": "https://github.com/Angelbots1339/2022_Competition_Season",
      "RobotName": "Jazzy Judi",
      "yearSummary": "We went to the Orange County Regional in California and placed 3rd, we won the Colorado Regional, our first ever. We then made it to the FRC World Championship where we placed 7th in the Hopper division and unseated the 3rd seeded team. During the summer we were invited to IRI, and made it into the finals."
    },
    {
      "year": "2020",
      "RobotImagePath": "/images/history/2020/2020Robot.jpg",
      "CadModelPath": "",
      "GameDescription": "In the game of 2020, Infinite Recharge, robots competed to score small yellow balls into goals. The low goal is worth 1 point, the high is worth 2, and a smaller goal inside the high shot is worth 3. In the endgame, robots climb their team's tilting bar, and if they can balance it with robots, they score extra points.",
      "GameName": "2020 Infinite Recharge",
      "RevealVideo": "",
      "GameReveal": "gmiYWTmFRVE",
      "RecapVideo": "",
      "GithubCode": "https://github.com/Angelbots1339/2020FinalBot",
      "RobotName": "Imperator",
      "yearSummary": "A very promising robot and team were able to play in Utah and place 2nd (captaining the #2 seed alliance) and earning a spot to the Championship, which was canceled along with the rest of the season due to the advent of Covid-19. We still managed to win Imagery again."
    },
    {
      "year": "2019",
      "RobotImagePath": "",
      "CadModelPath": "",
      "GameDescription": "For 2019's game, robots competed to store cargo (balls) into several containers labeled rocket ships, and then install circular hatch panels into the holes they just put cargo through. There are points available for moving off the flush or raised starting platforms, and returning to them at the end of the game.",
      "GameName": "2019 Destination: Deep Space",
      "RevealVideo": "",
      "GameReveal": "Mew6G_og-PI",
      "RecapVideo": "",
      "GithubCode": "",
      "RobotName": "Xenomorph",
      "yearSummary": "Our \"short\" robot could only do so much on the field, but it did it well enough to earn the Autonomous award in Utah, make it into playoffs at both Regionals, and come in 13th at Championship in the Carver Division, where we were picked for eliminations by the #1 seed, team 330."
    },
    {
      "year": "2018",
      "RobotImagePath": "",
      "CadModelPath": "",
      "GameDescription": "The game of 2018 consists of robots placing large yellow cubes in their team's assigned area of a switch or scale. These are rotating platforms, and whichever team has the most blocks will weigh down their side. While a side is weighed down, the team will earn a set amount of points per second, until they lose that station.",
      "GameName": "2018 FIRST Power Up",
      "RevealVideo": "L9aCeTpfUKk",
      "GameReveal": "HZbdwYiCY74",
      "RecapVideo": "tbb_z9BS53g",
      "GithubCode": "https://github.com/Angelbots1339/2018-Robot",
      "RobotName": "The DeLorean",
      "yearSummary": "With our strongest robot and strongest team ever, AngelBotics placed 2nd in Utah and 7th in Colorado, made deep runs in the playoffs, and won both the Excellence in Engineering and Imagery awards. We also went to our first off-season event in Texas, and won the event!"
    },
    {
      "year": "2017",
      "RobotImagePath": "",
      "CadModelPath": "",
      "GameDescription": "In 2017's game, there are hoppers placed around the field full of tiny, plastic yellow balls. These are then scored in the top or bottom of a team's boiler, top being worth more points. There are also gears delivered to raised human player stations in the middle of the field, and in endgame, robots climb a string hanging from these stations.",
      "GameName": "2017 FIRST Steamworks",
      "RevealVideo": "QhyeI6-TvxI",
      "GameReveal": "EMiNmJW7enI",
      "RecapVideo": "qnfytMcyrTg",
      "GithubCode": "https://github.com/Angelbots1339/2017-Robot",
      "RobotName": "Riptide",
      "yearSummary": "Finalists twice, in both Utah and Colorado, we received our second invitation to Champs (this time in Houston). Amazingly we placed 11th in the Roebling Division, though we were not picked for eliminations. What a ride though! We also won the Team Spirit award in Colorado."
    },
    {
      "year": "2016",
      "RobotImagePath": "/images/history/2016/2016RobotFlying.png",
      "CadModelPath": "",
      "GameDescription": "Each alliance in the 2016 game has a castle, and a row of defenses. These defences can be configured however the alliance decides. Robots launch boulders into the enemy castle, and after enough have been launched, the tower can be captured by all 3 attacking robots surrounding it, with an optional climb.",
      "GameName": "2016 FIRST Stronghold",
      "RevealVideo": "",
      "GameReveal": "VqOKzoHJDjA",
      "RecapVideo": "7fZWoDd7_gY",
      "GithubCode": "https://github.com/Angelbots1339/2016-Robot",
      "RobotName": "Horton",
      "yearSummary": "First trip to the World Championship in St. Louis! As finalists in Colorado, we took our Dr. Seuss themed team to Champs and had a blast. Thing 1 and Thing 2 were our drive team, and the robot (named Horton) had bumpers made from Truffula tufts (not really)."
    },
    {
      "year": "2015",
      "RobotImagePath": "",
      "CadModelPath": "",
      "GameDescription": "The 2015 game consists of stacking grey tote boxes, then recycling bins, and subsequently filling those bins with litter (foam noodles). These bins can only be stacked in specific areas. Any of the opposing alliance's litter that is not in a bin or the landfill at the center gives 4 points.",
      "GameName": "2015 Recycle Rush",
      "RevealVideo": "v3Gank-Nxe0",
      "GameReveal": "W6UYFKNGHJ8",
      "RecapVideo": "",
      "GithubCode": "https://github.com/Angelbots1339/2015-Robot",
      "RobotName": "The Bus",
      "yearSummary": "Dressed for 1969, AngelBotics won the Imagery award in both Utah and Colorado, and placed our highest ever in any event up to that point (4th after qualifications). For the first time we captained an eliminations match alliance."
    },
    {
      "year": "2014",
      "RobotImagePath": "/images/history/2014/2014Robot.jpg",
      "CadModelPath": "",
      "GameDescription": "The main game piece of the 2014 game is a giant exercise ball. These can be scored in either a high goal above the driver station, or a low goal to either side. Assisting a teammate in scoring the ball nets more points, and throwing a ball over the truss in the center gives even more.",
      "GameName": "2014 Aerial Assist",
      "RevealVideo": "BiZ5JvySo2k",
      "GameReveal": "oxp4dkMQ1Vo",
      "RecapVideo": "",
      "GithubCode": "https://github.com/Angelbots1339/2014-Robot",
      "RobotName": "Phoenix",
      "yearSummary": "AngelBotics attended the Utah Regional for the first time, where unfortunately the robot was literally torn in half during a brutal quarterfinals match. We made friends with our opponents (including 1619, Up-A-Creek Robotics) and rebuilt for Colorado. We won the Excellence in Engineering award and appeared in the quarterfinals at both events."
    },
    {
      "year": "2013",
      "RobotImagePath": "/images/history/2013/2013RobotPicture.JPG",
      "CadModelPath": "",
      "GameDescription": "The 2013 game consists of robots shooting plastic disks into a series of goals. There are several above driver stations, and one at the top of each team's pyramid on the field. At the end of the game, robots climb their alliance's pyramid, the higher the bar reached the more points they receive.",
      "GameName": "2013 Ultimate Ascent",
      "RevealVideo": "",
      "GameReveal": "itHNW2OFr4Y",
      "RecapVideo": "",
      "GithubCode": "https://github.com/Angelbots1339/2013-Robot",
      "RobotName": "Murus Angelorum",
      "yearSummary": "A simplified strategy led to a much more effective robot on the field, and our second appearance in a semifinal. We learned a lot from studying how other teams designed and built their robots in the off-season."
    },
    {
      "year": "2012",
      "RobotImagePath": "/images/history/2012/2012Robot.jpg",
      "CadModelPath": "",
      "GameDescription": "",
      "GameName": "Rebound Rumble",
      "RevealVideo": "",
      "GameReveal": "13HpbFjZWto",
      "RecapVideo": "",
      "GithubCode": "",
      "RobotName": "",
      "yearSummary": "Not a great year. We welcomed our mentors from United Launch Alliance (ULA) for the first time, but unfortunately built a robot that was poorly planned and executed. This year helped us rethink many of our attitudes and approaches to FRC, and ushered in a new era for the team."
    },
    {
      "year": "2011",
      "RobotImagePath": "/images/history/2011/2011Robot.JPG",
      "CadModelPath": "",
      "GameDescription": "",
      "GameName": "Logomotion",
      "RevealVideo": "",
      "GameReveal": "93Tygo0_O5c",
      "RecapVideo": "",
      "GithubCode": "",
      "RobotName": "Shaaark",
      "yearSummary": "Continuing with our fresh themes, we went with \"Hawaiian Surf\", won our second Imagery award, and made it all the way to the semifinals for the first time ever."
    },
    {
      "year": "2010",
      "RobotImagePath": "",
      "CadModelPath": "",
      "GameDescription": "",
      "GameName": "Breakaway",
      "RevealVideo": "",
      "GameReveal": "iheq7yar5c4",
      "RecapVideo": "",
      "GithubCode": "",
      "RobotName": "The Covered Wagon",
      "yearSummary": "A year of many firsts. Our first trip to another state (Louisiana), our first Imagery award (for theming as \"Old West\"), and we were picked for a playoff alliance in both CO and LA!"
    },
    {
      "year": "2009",
      "RobotImagePath": "",
      "CadModelPath": "",
      "GameDescription": "",
      "GameName": "Lunacy",
      "RevealVideo": "",
      "GameReveal": "ZnGfbGzEFrM",
      "RecapVideo": "",
      "GithubCode": "",
      "RobotName": "",
      "yearSummary": "Our first year as AngelBotics. Our Lunacy robot used in-frame suspension to keep the slick wheels in contact with the \"regolith\" floor, and we edged our way toward having a more competitive robot. Still had not made the cut to playoffs."
    },
    {
      "year": "2008",
      "RobotImagePath": "",
      "CadModelPath": "",
      "GameDescription": "",
      "GameName": "FIRST Overdrive",
      "RevealVideo": "",
      "GameReveal": "LYnUDaEi1D8",
      "RecapVideo": "",
      "GithubCode": "",
      "RobotName": "Beat Bot",
      "yearSummary": "With our newly optimistic attitude, we returned as Team BeatBot. Unfortunately our robot was overweight by almost 20 pounds, and we used the \"swiss cheese\" method to lighten up, which made our manipulator break. Won our first award, Xerox Creativity, for utilizing a rat trap as a chain tensioner."},
    {
      "year": "2007",
      "RobotImagePath": "/images/history/2007/2007Robot.JPG",
      "CadModelPath": "",
      "GameDescription": "",
      "GameName": "Rack 'n Roll",
      "RevealVideo": "",
      "GameReveal": "P3Ho_JnZB00",
      "RecapVideo": "",
      "GithubCode": "",
      "RobotName": "GhettoBot",
      "yearSummary": "After several years away from FIRST, we returned as Team GhettoBot, and built a robot with the help of mentors from a low rider shop. Our first \"elevator\" was made from an extension ladder."
    },
    {
      "year": "2004",
      "RobotImagePath": "",
      "CadModelPath": "",
      "GameDescription": "",
      "GameName": "FIRST Frenzy: Raising the Bar",
      "RevealVideo": "",
      "GameReveal": "Hza5WatrVI4",
      "RecapVideo": "",
      "GithubCode": "",
      "RobotName": "",
      "yearSummary": "In our inaugural year as a team, we hosted the kickoff event at East High School, and then went on to build a very simple robot using kids' bicycle wheels, DeWalt drill motors, and an abandoned doghouse. The robot drove once, fell over and broke. We only played in one round."
    }
  ],
  "template (For copy-paste to tabs only)": {
    "year": "",
    "RobotImagePath": "",
    "CadModelPath": "",
    "GameDescription": "",
    "GameName": "",
    "RevealVideo": "",
    "GameReveal": "",
    "RecapVideo": "",
    "GithubCode": "",
    "RobotName": "",
    "yearSummary": ""
  }
}

